content/notes/list_of_topics_i_d_like_to_research.md
---
title: "List of Topics I'd Like to Research"
author: ["Darrell Banks"]
date: 2025-05-07T00:00:00-06:00
lastmod: 2025-11-26T00:00:00-07:00
tags: ["notes"]
draft: false
---

**Connections**:  [Thinking]({{< relref "../categories/thinking.md" >}})

source: <https://www.cold-takes.com/learning-by-writing/>


## Research Process {#research-process}

1.  Pick a topic (“Find claims that are important if true, and might be true.”)
2.  Read and/or discuss with others (a bit)
3.  Explain and defend my current, incredibly premature hypothesis, in
    writing
4.  Find and list weaknesses in my case
5.  Pick a subquestion and do more reading
6.  Reverse my claim / switch sides
7.  Repeat steps 3-6 as necessary
8.  Get feedback on draft and use this to keep repeating steps 3-6


## Topics / Hypothesis {#topics-hypothesis}


### [ ] AI safety isn't advancing rapidly enough {#ai-safety-isn-t-advancing-rapidly-enough}


### [ ] In five years, web browsers will be dead. The web will be {#in-five-years-web-browsers-will-be-dead-dot-the-web-will-be}

something an AI agent uses on your behalf


#### <https://www.diabrowser.com/> {#https-www-dot-diabrowser-dot-com}


#### <https://sky.app/> {#https-sky-dot-app}
